################################################################################
# Intro01.R
# 03/22/2023
################################################################################
rm(list = ls()) # all clear

################################################################################
# Rの使い方と基礎概念
################################################################################
# "#"から後はコメントになり、プログラムの実行上無視される。

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# 電卓として使う
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
45 + 57
33 / 25
(sin(0.5)) ^ 2 + (cos(0.5)) ^ 2

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# ベクトル
#　注意: Rの変数名は大文字と小文字を区別する
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=

# - - - - - [c関数] ベクトルを作る関数
x <- c(0, 2, 5, 8)

#------------------------------------------------------------------------------#
# 添字による要素の取り出し
#------------------------------------------------------------------------------#
x[2]
x[c(2, 4)]

# 負の数はそれ以外を取りだす
x[-2]

#------------------------------------------------------------------------------#
# 論理変数による要素の取り出し
#------------------------------------------------------------------------------#
x[c(TRUE, FALSE, F, T)]     # TRUE, FALSEを推奨

# これにより条件式による取り出しが可能
x > 3
x[x > 3]

#------------------------------------------------------------------------------#
# 名前（属性）と名前による要素の取り出し
#------------------------------------------------------------------------------#
# - - - - - [names関数] 名前属性の表示・設定
names(x) <- c("Spring", "Summer", "Fall", "Winter")
x

x["Summer"]             # 名前による要素の取り出し

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# 行列と配列
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
#------------------------------------------------------------------------------#
# 行列
#------------------------------------------------------------------------------#
# - - - - - [seq関数] 数列を作る。変数は(始点、終点、間隔)
M0 <- seq(0.1, 2.4, 0.1)

# - - - - - [matrix関数] 行列を生成 (行列の要素を入れたベクトル, nrow:行数, ncol:列数)
M1 <- matrix(M0, nrow = 6, ncol = 4)

# - - - - - [paste0関数] 文字列を結合
paste0("R", seq(6))    

# - - - - - [list関数] リストを作成
# - - - - - [dimnames関数] 行列の行と列に名前をつける・表示する
dimnames(M1) <- list(paste0("R", seq(6)), paste0("C", seq(4)))
M1

#------------------------------------------------------------------------------#
# 配列
#------------------------------------------------------------------------------#
# - - - - - [array関数] 配列を生成
M2 <- array(M0, dim = c(2, 3, 4))   
dimnames(M2) <- list(paste0("A_", seq(2)), 
                     paste0("B_", seq(3)),
                     paste0("C_", seq(4)))

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# データフレーム
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
AgeData <- c(35, 42, 58, 25, 44)
CountryData <- c("JPN", "USA", "USA", "JPN", "JPN")
IncomeData <- c(40, 35, 52, 26, 32)

# - - - - - [data.frame関数] データフレームを生成
SurveyData <- data.frame(Age = AgeData, Country = CountryData, Income = IncomeData, 
                         stringsAsFactors = FALSE)
SurveyData$Income
SurveyData[2, 1]

SurveyData$Country[2] <- "FRA"

SurveyData

################################################################################
# JMD生命表(テキストデータ)を読み込んでグラフ表示
################################################################################
JMD_Dir <- "JMD/"

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# JMD生命表(テキストデータ)の読み込み
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# - - - - - [read.table関数] 表形式のテキストファイルの読み込み
LT_female <- read.table(file = paste0(JMD_Dir, "fltper_1x1.txt"), sep = "", 
                        header = TRUE, skip = 2, as.is = TRUE, na.strings = ".")

# - - - - - [subset関数] データフレームの一部を取り出す
mx_2020 <- subset(LT_female, Year == 2020)$mx

# - - - - - [plot関数] グラフの描画
plot(seq(0, 110) + 0.5, mx_2020,                    # x座標, y座標
     type = "l",                                    # グラフのタイプ(l:折線)
     log = "y",                                     # y軸を対数軸に設定
     main = "Mortality Rate(Female, 2020)",         # グラフタイトル
     xlab = "Age",                                  # x軸ラベル
     ylab = "Mortality Rate")                       # y軸ラベル

mx_1950 <- subset(LT_female, Year == 1950)$mx

# - - - - - [matplot関数] 複数系列のグラフの描画
# - - - - - [cbind関数] 行列を列方向に結合(cf. rbind)
matplot(seq(0, 110) + 0.5, cbind(mx_1950, mx_2020), # x座標, y座標
     type = "o",                                    # グラフのタイプ(o:マーカー付折線)
     log = "y",
     lty = c(1, 2),                                 # 線種
     lwd = c(1, 2),                                 # 線の太さ
     pch = c(1, 2),                                 # マーカーの種類
     cex = c(0.75, 0.75),                           # マーカーの大きさ
     col = c("blue", "red"),
     main = "Mortality Rate(Female, 1950, 2020)",
     xlab = "Age", 
     ylab = "Mortality Rate")

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# ggplot2パッケージを使ってグラフ表示
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# - - - - - [library関数] 使用するパッケージを読み込み(事前にインストールが必要)
library(ggplot2)    

# - - - - - [transform関数] データフレームの変形
# - - - - - [ifelse関数] ベクトルの条件選択
# - - - - - [as.numeric関数] 実数への変換

LT_female <- transform(LT_female, Age0 = ifelse(Age == "110+", 110, as.numeric(Age)))

# - - - - - [ggplot2関数] グラフの描画
ggplot(data = subset(LT_female, (Year %% 10) == 0), 
       mapping = aes(x = Age0, y = mx, group =Year, color = Year)) +
    geom_line() +
    scale_y_log10() +
    labs(title = "Mortality Rate(Female, 1950-2020)", x = "Age", y = "Mortality Rate") +
    theme(legend.position = "none")

